[
  {
    "id": 1168190,
    "type": "movie",
    "title": "The Wrecking Crew",
    "slug": "the-wrecking-crew",
    "overview": "Estranged half-brothers Jonny and James reunite after their father's mysterious death. As they search for the truth, buried secrets reveal a conspiracy threatening to tear their family apart.",
    "poster": "/gbVwHl4YPSq6BcC92TQpe7qUTh6.jpg",
    "backdrop": "/e4OnHU8HNAhdS6C4Ypk6NA26kPQ.jpg",
    "rating": 6.782,
    "releaseDate": "2026-01-28",
    "adult": false
  },
  {
    "id": 840464,
    "type": "movie",
    "title": "Greenland 2: Migration",
    "slug": "greenland-2-migration",
    "overview": "Having found the safety of the Greenland bunker after the comet Clarke decimated the Earth, the Garrity family must now risk everything to embark on a perilous journey across the wasteland of Europe to find a new home.",
    "poster": "/1mF4othta76CEXcL1YFInYudQ7K.jpg",
    "backdrop": "/tyjXlexbNZQ0ZT1KEJslQtBirqc.jpg",
    "rating": 6.482,
    "releaseDate": "2026-01-07",
    "adult": false
  },
  {
    "id": 1084242,
    "type": "movie",
    "title": "Zootopia 2",
    "slug": "zootopia-2",
    "overview": "After cracking the biggest case in Zootopia's history, rookie cops Judy Hopps and Nick Wilde find themselves on the twisting trail of a great mystery when Gary De'Snake arrives and turns the animal metropolis upside down. To crack the case, Judy and Nick must go undercover to unexpected new parts of town, where their growing partnership is tested like never before.",
    "poster": "/oJ7g2CifqpStmoYQyaLQgEU32qO.jpg",
    "backdrop": "/5h2EsPKNDdB3MAtOk9MB9Ycg9Rz.jpg",
    "rating": 7.633,
    "releaseDate": "2025-11-26",
    "adult": false
  },
  {
    "id": 1419406,
    "type": "movie",
    "title": "The Shadow's Edge",
    "slug": "the-shadows-edge",
    "overview": "Macau Police brings the tracking expert police officer out of retirement to help catch a dangerous group of professional thieves.",
    "poster": "/e0RU6KpdnrqFxDKlI3NOqN8nHL6.jpg",
    "backdrop": "/4BtL2vvEufDXDP4u6xQjjQ1Y2aT.jpg",
    "rating": 7.164,
    "releaseDate": "2025-08-16",
    "adult": false
  },
  {
    "id": 1368166,
    "type": "movie",
    "title": "The Housemaid",
    "slug": "the-housemaid",
    "overview": "Trying to escape her past, Millie Calloway accepts a job as a live-in housemaid for the wealthy Nina and Andrew Winchester. But what begins as a dream job quickly unravels into something far more dangerous—a sexy, seductive game of secrets, scandal, and power.",
    "poster": "/cWsBscZzwu5brg9YjNkGewRUvJX.jpg",
    "backdrop": "/tNONILTe9OJz574KZWaLze4v6RC.jpg",
    "rating": 7.088,
    "releaseDate": "2025-12-18",
    "adult": false
  },
  {
    "id": 1601243,
    "type": "movie",
    "title": "Oscar Shaw",
    "slug": "oscar-shaw",
    "overview": "After retiring from the police force, a relentless detective haunted by the tragic loss of his closest friend sets out on a perilous quest for vengeance, seeking redemption and fighting to restore justice to the streets he once swore to protect.",
    "poster": "/tsE3nySukwrfUjouz8vzvKTcXNC.jpg",
    "backdrop": "/6D6M5z4reppUxo2cnBEKI02Csp1.jpg",
    "rating": 5.8,
    "releaseDate": "2026-01-09",
    "adult": false
  },
  {
    "id": 1234731,
    "type": "movie",
    "title": "Anaconda",
    "slug": "anaconda",
    "overview": "A group of friends facing mid-life crises head to the rainforest with the intention of remaking their favorite movie from their youth, only to find themselves in a fight for their lives against natural disasters, giant snakes and violent criminals.",
    "poster": "/qxMv3HwAB3XPuwNLMhVRg795Ktp.jpg",
    "backdrop": "/swxhEJsAWms6X1fDZ4HdbvYBSf9.jpg",
    "rating": 5.877,
    "releaseDate": "2025-12-24",
    "adult": false
  },
  {
    "id": 1271895,
    "type": "movie",
    "title": "96 Minutes",
    "slug": "96-minutes",
    "overview": "Former bomb disposal expert, Song Kang-Ren, and his fiancée, Huang Xin, board a high-speed train that contains a bomb. At the same time, Liu Kai, a well-known physics teacher who was involved in an affair scandal, also boards this same train in order to win back his wife, Ting Juan, who took the prior high-speed rail to return home in frustration…  After all, can the bomb be successfully defused this time? and resolve the crisis?",
    "poster": "/gWKZ1iLhukvLoh8XY2N4tMvRQ2M.jpg",
    "backdrop": "/lAtuFCx6cYkNBmTMSNnLE0qlCLx.jpg",
    "rating": 6.381,
    "releaseDate": "2025-09-05",
    "adult": false
  },
  {
    "id": 1310568,
    "type": "movie",
    "title": "Murder at the Embassy",
    "slug": "murder-at-the-embassy",
    "overview": "1934. Private detective Miranda Green investigates a murder perpetrated in the British Embassy in Cairo, where a top secret document was stolen, risking to jeopardize both Buckingham Palace and the peace of the world. All those present in this closed place are suspected: the American photographer, the English student, the American actress, the Egyptian security guard, the ambassador interpreter, the Egyptian gardener and - why not? — the Ambassador himself. But who would have expected that a small group of Nazis would be behind a plot, risking to jeopardize both Buckingham Palace and the peace of the world?",
    "poster": "/3DBmBItPdy0A2ol59jgHhS54Lua.jpg",
    "backdrop": "/gLXibzLQ4qegvjdqDC0f8yTij2P.jpg",
    "rating": 5.5,
    "releaseDate": "2025-11-14",
    "adult": false
  },
  {
    "id": 1584215,
    "type": "movie",
    "title": "The Internship",
    "slug": "the-internship",
    "overview": "A CIA-trained assassin recruits other graduates from her secret childhood program, The Internship, to violently destroy the organization. The CIA fights back with deadly force.",
    "poster": "/fYqSOkix4rbDiZW0ACNnvZCpT6X.jpg",
    "backdrop": "/eUERZRVjCTNdgnESlQxyaOJ2d4K.jpg",
    "rating": 6,
    "releaseDate": "2026-01-13",
    "adult": false
  },
  {
    "id": 83533,
    "type": "movie",
    "title": "Avatar: Fire and Ash",
    "slug": "avatar-fire-and-ash",
    "overview": "In the wake of the devastating war against the RDA and the loss of their eldest son, Jake Sully and Neytiri face a new threat on Pandora: the Ash People, a violent and power-hungry Na'vi tribe led by the ruthless Varang. Jake's family must fight for their survival and the future of Pandora in a conflict that pushes them to their emotional and physical limits.",
    "poster": "/5bxrxnRaxZooBAxgUVBZ13dpzC7.jpg",
    "backdrop": "/sdZSjtGUTSN8B3al5o0f2WoQfQQ.jpg",
    "rating": 7.295,
    "releaseDate": "2025-12-17",
    "adult": false
  },
  {
    "id": 1242898,
    "type": "movie",
    "title": "Predator: Badlands",
    "slug": "predator-badlands",
    "overview": "Cast out from his clan, a young Predator finds an unlikely ally in a damaged android and embarks on a treacherous journey in search of the ultimate adversary.",
    "poster": "/pHpq9yNUIo6aDoCXEBzjSolywgz.jpg",
    "backdrop": "/ebyxeBh56QNXxSJgTnmz7fXAlwk.jpg",
    "rating": 7.8,
    "releaseDate": "2025-11-05",
    "adult": false
  },
  {
    "id": 1306368,
    "type": "movie",
    "title": "The Rip",
    "slug": "the-rip",
    "overview": "Trust frays when a team of Miami cops discovers millions in cash inside a run-down stash house, calling everyone — and everything — into question.",
    "poster": "/eZo31Dhl5BQ6GfbMNf3oU0tUvPZ.jpg",
    "backdrop": "/3F2EXWF1thX0BdrVaKvnm6mAhqh.jpg",
    "rating": 7.027,
    "releaseDate": "2026-01-13",
    "adult": false
  },
  {
    "id": 1167307,
    "type": "movie",
    "title": "David",
    "slug": "david",
    "overview": "From the songs of his mother’s heart to the whispers of a faithful God, David’s story begins in quiet devotion. When the giant Goliath rises to terrorize a nation, a young shepherd armed with only a sling, a few stones, and unshakable faith steps forward. Pursued by power and driven by purpose, his journey tests the limits of loyalty, love, and courage—culminating in a battle not just for a crown, but for the soul of a kingdom.",
    "poster": "/bESlrLOrsQ9gKzaGQGHXKOyIUtX.jpg",
    "backdrop": "/oN4TQ1TxchynXlFiXFBL3NHLT54.jpg",
    "rating": 8,
    "releaseDate": "2025-12-14",
    "adult": false
  },
  {
    "id": 1198994,
    "type": "movie",
    "title": "Send Help",
    "slug": "send-help",
    "overview": "Two colleagues become stranded on a deserted island, the only survivors of a plane crash. On the island, they must overcome past grievances and work together to survive, but ultimately, it's a battle of wills and wits to make it out alive.",
    "poster": "/kL4MgAIZIYX3sCeG34N0XfVhCtt.jpg",
    "backdrop": "/eyvIBnJSxZDyek4s7YytUNmtstR.jpg",
    "rating": 7.127,
    "releaseDate": "2026-01-22",
    "adult": false
  },
  {
    "id": 755898,
    "type": "movie",
    "title": "War of the Worlds",
    "slug": "war-of-the-worlds",
    "overview": "Will Radford is a top analyst for Homeland Security who tracks potential threats through a mass surveillance program, until one day an attack by an unknown entity leads him to question whether the government is hiding something from him... and from the rest of the world.",
    "poster": "/yvirUYrva23IudARHn3mMGVxWqM.jpg",
    "backdrop": "/iZLqwEwUViJdSkGVjePGhxYzbDb.jpg",
    "rating": 4.217,
    "releaseDate": "2025-07-29",
    "adult": false
  },
  {
    "id": 1043197,
    "type": "movie",
    "title": "Dust Bunny",
    "slug": "dust-bunny",
    "overview": "Ten-year-old Aurora asks her hitman neighbor to kill the monster under her bed that she claims ate her family. To protect her, he must battle an onslaught of assassins while accepting that some monsters are real.",
    "poster": "/vobigFZFvbYPf6ElYJu07P9rH8C.jpg",
    "backdrop": "/AecGG1XVCmkk7fT10ko3FC0dLIP.jpg",
    "rating": 6.621,
    "releaseDate": "2025-12-11",
    "adult": false
  },
  {
    "id": 1290821,
    "type": "movie",
    "title": "Shelter",
    "slug": "shelter",
    "overview": "A man living in self-imposed exile on a remote island rescues a young girl from a violent storm, setting off a chain of events that forces him out of seclusion to protect her from enemies tied to his past.",
    "poster": "/klvZs66SG19qmacdwxSRkdFQhQS.jpg",
    "backdrop": "/uCGzI1EtQWXG5yRPB5PSyOdFNcC.jpg",
    "rating": 7.6,
    "releaseDate": "2026-01-28",
    "adult": false
  },
  {
    "id": 1116201,
    "type": "movie",
    "title": "Iron Lung",
    "slug": "iron-lung",
    "overview": "The stars are gone. The planets have disappeared. Only individuals aboard space stations or starships were left to give the end a name -- The Quiet Rapture. After decades of decay and crumbling infrastructure, the Consolidation of Iron has made a discovery on a barren moon designated AT-5. An ocean of blood. Hoping to discover desperately needed resources they immediately launch an expedition. A submarine is crafted and a convict is welded inside. Due to the pressure and depth of the ocean the forward viewport has been encased in metal. If successful, they will earn their freedom. If not, another will follow. This will be the 13th expedition.",
    "poster": "/sIwakdbMGS1krtgendTWpxTY9Hw.jpg",
    "backdrop": "/gqGQ0zADV5FIcgMWtWX8FcGQjFp.jpg",
    "rating": 7.614,
    "releaseDate": "2026-01-29",
    "adult": false
  },
  {
    "id": 1311031,
    "type": "movie",
    "title": "Demon Slayer: Kimetsu no Yaiba Infinity Castle",
    "slug": "demon-slayer-kimetsu-no-yaiba-infinity-castle",
    "overview": "The Demon Slayer Corps are drawn into the Infinity Castle, where Tanjiro, Nezuko, and the Hashira face terrifying Upper Rank demons in a desperate fight as the final battle against Muzan Kibutsuji begins.",
    "poster": "/fWVSwgjpT2D78VUh6X8UBd2rorW.jpg",
    "backdrop": "/1RgPyOhN4DRs225BGTlHJqCudII.jpg",
    "rating": 7.683,
    "releaseDate": "2025-07-18",
    "adult": false
  }
]